Revit 2027 API
ParameterTypeId.SteelElemWeldPrefix Property
 "Prefix"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldPrefix { get; }
Public Shared ReadOnly Property SteelElemWeldPrefix As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldPrefix {
	ForgeTypeId^ get ();
}
static member SteelElemWeldPrefix : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace